#include <stdio.h>
#include "mpi.h"
#include <stdlib.h>
#include <string.h>

void Check_MPI_Routines (int return_value, char *mpi_routine);                                           // Δήλωση του πρωτότυπου της συνάρτησης "Check_MPI_Routines ()" που ο κώδικας της βρίσκεται στις γραμμές 192-199
void Check_Memory (int *seq);                                                                            // Δήλωση του πρωτότυπου της συνάρτησης "Check_Memory ()" που ο κώδικας της βρίσκεται στις γραμμές 201-208
void Check_Sort_Breaker (int *seq, int n, int *ptr_sort_breaker, int *ptr_sort_breaker_exist);           // Δήλωση του πρωτότυπου της συνάρτησης "Check_Sort_Breaker ()" που ο κώδικας της βρίσκεται στις γραμμές 210-228

int main (int argc, char *argv[])
{
/*********************************************************************************************** Δ΄ήλωση μεταβλητών ***********************************************************************************************/
    int rank, p;                                                                                         // Το αναγνωριστικό της διεργασίας, Το πλήθος των διεργασιών
    int N, elements_per_processor;                                                                       // Το μέγεθος της ακολουθίας, Το πλήθος των στοιχείων που θα έχει στην κατοχή της η κάθε διεργασία για έλεγχο
    int *Seq, *Seq_per_processor;                                                                        // Η ακολουθία, Το τμήμα της ακολουθίας που θα έχει στην κατοχή της η κάθε διεργασία για έλεγχο
    int dest, src;                                                                                       // Βοηθητική μεταβλητή για την ισοκατανομή των στοιχειών στις διεργασίες P1,...,P(p-1) από την διεργασία P0, Βοηθητική μεταβλητή της διεργασίας P0 για την παραλαβή της κατάστασης ταξινόμησης των στοιχείων από τις υπόλοιπες διεργασίες
    int sort_breaker, first_sort_breaker;                                                                // Το στοιχείο που χαλάει την ταξινόμηση, Το πρώτο στοιχείο που χαλάει την ταξινόμηση
    int sort_breaker_exist, first_sort_breaker_stored;                                                   // Ένδειξη για την ύπαρξη στοιχείου που χαλάει την ταξινόμηση, Ένδειξη για την αποθήκευση του πρώτου στοιχείου που χαλάει την ταξινόμηση
    int last_element_send, last_element_recv;                                                            // Το τελευταίο στοιχείο μίας διεργασίας για αποστολή στην αμέσως επόμενη, Το τελευταίο στοιχείο μίας διεργασίας για παραλαβή από την αμέσως επόμενη
    int choice, k;                                                                                       // Η επιλογή για το μενού, Βοηθητική μεταβλητή για την ορθή ισοκατανομή των στοιχείων στις διεργασίες 
    int i, j;                                                                                            // Βοηθητικές μεταβλητές για την εκτέλεση βρόχων
    int tag_N = 1;                                                                                       // Η ετικέτα αποστολής-παραλαβής μεταξύ διεργασιών για το μέγεθος της ακολουθίας
    int tag_Seq = 2;                                                                                     // Η ετικέτα αποστολής-παραλαβής μεταξύ διεργασιών για τα στοιχεία της ακολουθίας
    int tag_Check_Sort_Seq = 3;                                                                          // Η ετικέτα αποστολής-παραλαβής μεταξύ διεργασιών για τον έλεγχο ταξινόμησης των στοιχείων της κάθε διεργασίας
    int tag_Sort_Breaker = 4;                                                                            // Η ετικέτα αποστολής-παραλαβής μεταξύ διεργασιών για τυχόν στοιχείο που χαλάει την ταξινόμηση
    int tag_Last_Element = 5;                                                                            // Η ετικέτα αποστολής-παραλαβής μεταξύ διεργασιών για το τελευταίο στοιχείο που έχουν στην κατοχή τους
    int tag_Choice = 6;                                                                                  // Η ετικέτα αποστολής-παραλαβής μεταξύ διεργασιών για την επιλογή στο μενού
    char is_sort[5];                                                                                     // Η αποθηκευτική μονάδα για την κατάσταση της ταξινόμησης των στοιχείων κάθε διεργασίας 
    MPI_Status status;                                                                                   // Η κατάσταση μίας παραλαβής από μία διεργασία με πομπό άλλη διεργασία
 /******************************************************************************************* Έναρξη του MPI περιβάλλοντος **************************************************************************************/   
    Check_MPI_Routines (MPI_Init (&argc, &argv), "MPI_Init ()");                                         // Έναρξη της χρήσης των MPI ρουτίνων και έλεγχος με την "Check_MPI_Routines ()" για τυχόν δυσλειτουργία
    Check_MPI_Routines (MPI_Comm_rank(MPI_COMM_WORLD, &rank), "MPI_Comm_rank ()");                       // Εκχώρηση στην rank το αναγνωριστικό της κάθε διεργασίας και έλεγχος με την "Check_MPI_Routines ()" για τυχόν δυσλειτουργία
    Check_MPI_Routines (MPI_Comm_size(MPI_COMM_WORLD, &p), "MPI_Comm_size ()");                          // Εκχώρηση στην p το πλήθος των διεργασιών και έλεγχος με την "Check_MPI_Routines ()" για τυχόν δυσλειτουργία
 /******************************************************************************************* Ατέρμονος βρόχος **************************************************************************************************/
    while (1)                                                                                           
    {
/*-------------------------------------------------------------------------------------------------- P0 --------------------------------------------------------------------------------------------------------*/
        if (rank == 0)                                                                                   /* Κώδικας που θα εκτελέσει μόνο η διεργασία P0 */
        {
            do                                                                                           /* Β΄ροχος για την εξασφάλιση ότι το μέγεθος της ακολουθίας θα είναι ακέραιο πολλαπλάσιο με το πλήθος των διεργασιών */
            {
                system ("clear");                                                                        // Καθαρισμός της οθόνης 
                printf ("Number of processors are %d\n", p);                                             // Εκτύπωση του πλήθους των διεργασιών 
                printf ("Size of integers' sequence must be integer multiple of number of processors (N mod processors == 0).\n"); // Εκτύπωση της συνθήκης του βρόχου σε φυσική γλώσσα
                printf ("Input the size of integers' sequence : ");                                      // Εκτύπωση για εισαγωγή του μεγέθους της ακολουθίας
                scanf ("%d", &N);                                                                        // Εισαγωγή του μεγέθους της ακολουθίας 
            }
            while (N % p != 0);                                                                          /* Η συνθήκη */
            
            Seq = (int *) malloc (N * sizeof (int));                                                     // Δυναμική δέσμευση μνήμης για την αποθήκευση της ακολουθίας
            Check_Memory (Seq);                                                                          // Έλεγχος με την "Check_Memory ()" για τυχόν δυσλειτουργία
            printf ("Input the integers' sequence\n");                                                   // Εκτύπωση για εισαγωγή στοιχείων στην ακολουθία
            for (i = 0; i < N; i++)                                                                      /* Βρόχος για την προσπέλαση της ακολουθίας */
            {
                printf ("Seq[%d] : ", i);                                                                // Εκτύπωση των θέσεων της ακολουθίας
                scanf ("%d", &Seq[i]);                                                                   // Εισαγωγή στοιχείων στην ακολουθίας
            }
            for (dest = 1; dest < p; dest++)                                                             /* Βοηθητικός βρόχος για την αποστολή του μεγέθους της ακολουθίας στις υπόλοιπες διεργασίες P1...P(p-1) */
               Check_MPI_Routines (MPI_Send (&N, 1, MPI_INT, dest, tag_N, MPI_COMM_WORLD), "MPI_Send ()"); // Aποστολή του μεγέθους της ακολουθίας στις υπόλοιπες διεργασίες P1...P(p-1) και έλεγχος με την "Check_MPI_Routines ()" για τυχόν δυσλειτουργία
/*................................. Αναμονή μέχρι ο παραλήπτης (dest) καλέσει την αντίστοιχη MPI_Recv (γραμμή 78) με ετικέτα tag_N (παραλήπτες: P1,...,P(p-1)) ..................................................*/            
            elements_per_processor = N / p;                                                              // Το πλήθος των στοιχείων που θα έχει στην κατοχή της η κάθε διεργασία
            k = elements_per_processor;                                                                  // Αποθήκευση του πλήθους των στοιχείων που θα έχει στην κατοχή της η κάθε διεργασία σε μία βοηθητική μεταβλητή για την ορθή ισοκατανομή των στοιχείων στις διεργασίες 
            
            Seq_per_processor = (int *) malloc (elements_per_processor * sizeof (int));                  // Δυναμική δέσμευση μνήμης για την αποθήκευση του τμήματος της ακολουθίας που θα έχει στην κατοχή της η διεργασία P0
            Check_Memory (Seq_per_processor);                                                            // Έλεγχος με την "Check_Memory ()" για τυχόν δυσλειτουργία
            for (dest = 1; dest < p; dest++)                                                             /* Βοηθητικός βρόχος για την ορθή ισοκατανομή των στοιχείων που θα έχουν στην κατοχή τους η κάθε μία από τις υπόλοιπες διεργασίες P1,...,P(p-1) */
            {
                Check_MPI_Routines (MPI_Send (&Seq[k], elements_per_processor, MPI_INT, dest, tag_Seq, MPI_COMM_WORLD), "MPI_Send ()"); // Αποστολή του αντίστοιχου τμήματος της ακολουθίας που θα έχει στην κατοχή της η κάθε μία από τις υπόλοιπες διεργασίες P1,...,P(p-1)
/*................................. Αναμονή μέχρι ο παραλήπτης (dest) καλέσει την αντίστοιχη MPI_Recv (γραμμή 83) με ετικέτα tag_Seq (παραλήπτες: P1,...,P(p-1)) ................................................*/
                k += elements_per_processor;                                                             // Αύξηση της βοηθητικής μεταβλητής  για την ορθή ισοκατανομή των στοιχείων στις διεργασίες κατά το πλήθος των στοιχείων της κάθε διεργασίας 
            }
            for (j = 0; j < elements_per_processor; j++)                                                 /* Βρόχος για την κατανομή των στοιχείων της ακολουθ΄ίας που ανήκουν στην διεργασία P0 */
                Seq_per_processor[j] = Seq[j];                                                           // Αποθήκευση του κάθε στοιχείου που ανήκει στην διεργασία P0
        }
/*-------------------------------------------------------------------------------------------------- P1,...,P(p-1) ---------------------------------------------------------------------------------------------*/
        else                                                                                             /* Κώδικας που θα εκτελέσουν μόνο οι διεργασίες P1,...,P(p-1) */
        {
            Check_MPI_Routines (MPI_Recv (&N, 1, MPI_INT, 0, tag_N, MPI_COMM_WORLD, &status), "MPI_Recv ()"); // Παραλαβή του μεγέθους της ακολουθίας από την διεργασία P0 και έλεγχος με την "Check_MPI_Routines ()" για τυχόν δυσλειτουργία
/*................................. Αναμονή μέχρι ο πομπός καλέσει την αντίστοιχη MPI_Send (γραμμή 59) με ετικέτα tag_N (πομπός: P0) .............................................................................*/
            elements_per_processor = N / p;                                                              // Το πλήθος των στοιχείων που θα έχει στην κατοχή της η κάθε διεργασία πλην της P0
            Seq_per_processor = (int *) malloc (elements_per_processor * sizeof (int));                  // Δυναμική δέσμευση μνήμης για την αποθήκευση του τμήματος της ακολουθίας που θα έχει στην κατοχή της η κάθε διεργασία πλην της P0
            Check_Memory (Seq_per_processor);                                                            // Έλεγχος με την "Check_Memory ()" για τυχόν δυσλειτουργία
            Check_MPI_Routines (MPI_Recv (&Seq_per_processor[0], elements_per_processor, MPI_INT, 0, tag_Seq, MPI_COMM_WORLD, &status), "MPI_Recv ()"); // Παραλαβή του αντίστοιχου τμήματος της ακολουθίας από την διεργασία P0, που θα έχει στην κατοχή της η κάθε μία από τις υπόλοιπες διεργασίες P1...P(p-1) και έλεγχος με την "Check_MPI_Routines ()" για τυχόν δυσλειτουργία
/*................................. Αναμονή μέχρι ο πομπός καλέσει την αντίστοιχη MPI_Send (γραμμή 68) με ετικέτα tag_Seq (πομπός: P0) ...........................................................................*/
        }
/*-------------------------------------------------------------------------------------------------- P0,...,P(p-1) ---------------------------------------------------------------------------------------------*/   
        sort_breaker_exist = 0;                                                                          // Αρχικοποίηση της ένδειξης για την ύπαρξη τυχόν στοιχείου που χαλάει την ταξινόμηση
        Check_Sort_Breaker (Seq_per_processor, elements_per_processor, &sort_breaker, &sort_breaker_exist); // Κλήση της συνάρτησης "Check_Sort_Breaker ()" για την υπάρξη τυχόν στοιχείου που χαλάει την ταξινόμηση των στοιχείων που κατέχει η εκάστοτε διεργασία που την καλεί
/*-------------------------------------------------------------------------------------------------- P0,...,P(p-2) ---------------------------------------------------------------------------------------------*/
        if (rank != p - 1)                                                                               /* Κώδικας που θα εκτελέσουν μόνο οι διεργασίες P0,...,P(p-2) */
        {
            last_element_send = Seq_per_processor[elements_per_processor - 1];                           // Αποθ΄ήκευση του τελευταίου στοιχείου από το τμήμα που κατέχει η εκάστοτε διεργασία
            Check_MPI_Routines (MPI_Send (&last_element_send, 1, MPI_INT, (rank + 1) % p, tag_Last_Element, MPI_COMM_WORLD), "MPI_Send ()"); // Αποστολή του τελευταίου στοιχείου από το τμήμα που κατέχει η εκάστοτε διεργασία στην αμέσως επόμενη διεργασία και έλεγχος με την "Check_MPI_Routines ()" για τυχόν δυσλειτουργία
/*................................. Αναμονή μέχρι ο παραλήπτης ((rank + 1) % p) καλέσει την αντίστοιχη MPI_Recv (γραμμή 99) με ετικέτα tag_Last_Element (παραλήπτες: P1,...,P(p-1)) ..............................*/
        }
/*-------------------------------------------------------------------------------------------------- P1,...,P(p-1) ---------------------------------------------------------------------------------------------*/
        if (rank != 0)                                                                                   /* Κώδικας που θα εκτελέσουν μόνο οι διεργασίες P1,...,P(p-1) */
        {
            Check_MPI_Routines (MPI_Recv (&last_element_recv, 1, MPI_INT, rank - 1, tag_Last_Element, MPI_COMM_WORLD, &status), "MPI_Recv ()"); // Η διεργασία που την καλεί λαμβάνει το τελευταίο στοιχείο της αμέσως προηγόυμενης διεργασίας και έλεγχος με την "Check_MPI_Routines ()" για τυχόν δυσλειτουργία
/*................................. Αναμονή μέχρι ο πομπός (rank - 1) καλέσει την αντίστοιχη MPI_Send (γραμμή 93) με ετικέτα tag_Last_Element (πομποί: P0,...,P(p-2)) ............................................*/            
            if (last_element_recv > Seq_per_processor[0])                                                /* Το τελευταίο στοιχείο της αμέσως προηγούμενης διεργασίας είναι μεγαλύτερο από το πρώτο στοιχείο της διεργασίας */
            {
                sort_breaker = last_element_recv;                                                        // Αποθήκευση του τελευταίου στοιχείου της αμέσως προηγούμενης διεργασίας ως το στοιχείο που χαλάει την ταξινόμηση
                sort_breaker_exist = 1;                                                                  // Ένδειξη ότι υπάρχει στοιχείο που χαλάει την ταξινόμηση
            }
            if (!sort_breaker_exist)                                                                     /* Το τελευταίο στοιχείο της αμέσως προηγούμενης διεργασίας δεν χαλάει την ταξινόμηση των στοιχείων της εκάστοτε διεργασίας */
            {
                strcpy (is_sort, "yes");                                                                 // Επιβεβαίωση της διεργασίας πλην της P0, ότι δεν υπάρχουν στοιχεία που χαλάνε την ταξινόμηση των στοιχείων της
                Check_MPI_Routines (MPI_Send (&is_sort, 5, MPI_CHAR, 0, tag_Check_Sort_Seq, MPI_COMM_WORLD), "MPI_Send ()"); // Αποστολή της συμβολοσειράς επιβεβαίωσης απουσίας στοιχείου που χαλάει την ταξινόμηση στην διεργασία P0 και έλεγχος με την "Check_MPI_Routines ()" για τυχόν δυσλειτουργία
/*................................. Αναμονή μέχρι ο παραλήπτης καλέσει την αντίστοιχη MPI_Recv (γραμμή 115) με ετικέτα tag_Check_Sort_Seq (παραλήπτης: P0) .......................................................*/
            }
            else                                                                                         /* Το τελευταίο στοιχείο της αμέσως προηγούμενης διεργασίας χαλάει την ταξινόμηση των στοιχείων της εκάστοτε διεργασίας  */
            {
                strcpy (is_sort, "no");                                                                  // Επιβεβαίωση της διεργασίας πλην της P0, ότι υπάρχουν στοιχεία που χαλάνε την ταξινόμηση των στοιχείων της
                Check_MPI_Routines (MPI_Send (&is_sort, 5, MPI_CHAR, 0, tag_Check_Sort_Seq, MPI_COMM_WORLD), "MPI_Send ()");   // Αποστολή της συμβολοσειράς επιβεβαίωσης ύπαρξης στοιχείου που χαλάει την ταξινόμηση στην διεργασία P0 και έλεγχος με την "Check_MPI_Routines ()" για τυχόν δυσλειτουργία
/*................................. Αναμονή μέχρι ο παραλήπτης καλέσει την αντίστοιχη MPI_Recv (γραμμή 134) με ετικέτα tag_Check_Sort_Seq (παραλήπτης: P0) .......................................................*/
                Check_MPI_Routines (MPI_Send (&sort_breaker, 1, MPI_INT, 0, tag_Sort_Breaker, MPI_COMM_WORLD), "MPI_Send ()"); // Αποστολή του στοιχείου που χαλάει την ταξινόμηση των στοιχείων της εκάστοτε διεργασίας, στην διεργασία P0 και έλεγχος με την "Check_MPI_Routines ()" για τυχόν δυσλειτουργία
/*................................. Αναμονή μέχρι ο παραλήπτης καλέσει την αντίστοιχη MPI_Recv (γραμμή 138) με ετικέτα tag_Sort_Breaker (παραλήπτης: P0) .........................................................*/
            }
            free (Seq_per_processor);                                                                    // Αποδέσμευση της μνήμης που χρησιμοποιήθηκε για την αποθήκευση του τμήματος της ακολουθίας που πήρε η κάθε διεργασία από την P0
        }
/*-------------------------------------------------------------------------------------------------- P0 --------------------------------------------------------------------------------------------------------*/
        else                                                                                             /* Κώδικας που θα εκτελέσει μόνο η διεργασ΄΄ια P0 */
        {
            if (sort_breaker_exist)                                                                      /* Η διεργασία P0 έχει στοιχείο που χαλάει την ταξινόμηση */
            {
                first_sort_breaker = sort_breaker;                                                       // Αποθήκευση του στοιχείου της P0 που χαλάει την ταξινόμηση που είναι και το πρώτο της ακολουθίας 
                first_sort_breaker_stored = 1;                                                           // Αρχικοποίηση της ένδειξης για την αποφυγή της αποθήκευσης των τυχόν στοιχείων που χαλάνε την ταξινόμηση από τις διεργασίες P1...P(p-1)
            }
            else                                                                                         /* Η διεργασία P0 δεν έχει στοιχείο που χαλάει την ταξινόμηση */
                first_sort_breaker_stored = 0;                                                           // Αρχικοποίηση της ένδειξης για την αποθήκευση του πρώτου στοιχείου που χαλάει την ταξινόμηση από τις διεργασίες P1...P(p-1)                                                  
            for (src = 1; src < p; src++)                                                                /* Βοηθητικός βρόχος για την παραλαβή της κατάστασης της ταξινόμησης των στοιχείων και των υπόλοιπων διεργασιών P1...P(p-1) */ 
            {        
                Check_MPI_Routines (MPI_Recv (&is_sort, 5, MPI_CHAR, src, tag_Check_Sort_Seq, MPI_COMM_WORLD, &status), "MPI_Recv ()"); // Παραλαβή της κατάστασης της ταξινόμησης των στοιχείων και των υπόλοιπων διεργασιών P1...P(p-1) και έλεγχος με την "Check_MPI_Routines ()" για τυχόν δυσλειτουργία
/*................................. Αναμονή μέχρι ο πομπός (src) καλέσει την αντίστοιχη MPI_Send (γραμμή 115) με ετικέτα tag_Check_Sort_Seq (πομποί: P1,...,P(p-1)) .............................................*/                 
                if (!strcmp (is_sort, "no"))                                                             /* Η ταξινόμηση χαλάει στα στοιχεία μίας διεργασίας πλην της P0 */
                {
                    Check_MPI_Routines (MPI_Recv (&sort_breaker, 1, MPI_INT, src, tag_Sort_Breaker, MPI_COMM_WORLD, &status), "MPI_Recv ()"); // Παραλαβή του στοιχείου που χαλάει την ταξινόμηση από την διεργασία που έστειλε στην P0 την συμβολοσειρά no και έλεγχος με την "Check_MPI_Routines ()" για τυχόν δυσλειτουργία
/*................................. Αναμονή μέχρι ο πομπός (src) καλέσει την αντίστοιχη MPI_Send (γραμμή 117) με ετικέτα tag_Sort_Breaker (πομποί: P1 Ή ... Ή P(p-1)) ............................................*/ 
                    if (first_sort_breaker_stored == 0)                                                  /* Η πρώτη διεργασία πλην της P0 που στ΄έλνει το στοιχείο που χαλάει την ταξινόμηση */
                        first_sort_breaker = sort_breaker;                                               // Το πρώτο στοιχείο που χαλάει την ταξινόμηση χωρίς να ληφθεί υπόψιν ακόμα η κατάσταση της διεργασίας P0
                    first_sort_breaker_stored++;                                                         // Αύξηση της ένδειξης, ώστε να αποθηκευτεί προσωρινά το πρώτο στοιχείο που χαλάει την ταξινόμηση
                }
            }
            if (!first_sort_breaker_stored && !sort_breaker_exist)                                       /* Δεν υπάρχουν στοιχεία που χαλάνε την ταξινόμηση όλης της ακολουθίας */
            {
               printf ("\n\n------------------- P%d -----------------------------\n\n", rank);           // Εκτύπωση του αναγνωριστικού της διεργασίας που εκτελεί την εντολή αυτή (P0)
               printf ("Is sequence sorted? yes\n");                                                     // Το πόρισμα της διεργασίας P0 ότι η ακολουθία είναι ταξινομημένη
            }
            else                                                                                         /* Υπάρχουν στοιχεία που χαλάνε την ταξινόμηση όλης της ακολουθίας */
            {
                printf ("\n\n------------------- P%d -----------------------------\n\n", rank);          // Εκτύπωση του αναγνωριστικού της διεργασίας που εκτελεί την εντολή αυτή (P0)
                printf ("Is sequence sorted? no\n");                                                     // Το πόρισμα της διεργασίας 0 (P0) ότι η ακολουθία δεν είναι ταξινομημένη
                printf ("Which is the 1st sort breaker? %d\n", first_sort_breaker);                      // Εκτύπωση του πρώτου στοιχείου που χαλάει την ταξινόμηση της ακολουθίας 
            }
            free (Seq);                                                                                  // Αποδέσμευση της μνήμης που χρησιμοποιήθηκε για όλη την ακολουθία
            free (Seq_per_processor);                                                                    // Αποδέσμευση της μνήμης που χρησιμοποιήθηκε για την αποθήκευση του τμήματος της ακολουθίας που πήρε η διεργασία P0
/**************************************************************************************************** Μενο΄ύ ******************************************************************************************************/
            do                                                                                               /* Βρόχος για την εξασφάλιση έγκυρης επιλογής από το μενού */
            {
                printf ("\n");
                printf ("[1] Continue...\n");
                printf ("[2] Exit...\n");
                printf ("Input a choice : ");
                scanf ("%d", &choice);                                                                       // Εισαγωγή της επιλογής από το παραπάνω μενού
                if (choice != 1 && choice != 2)                                                              /* Άκυρη επιλογή */
                    printf ("Invalid choice!\n");                                                            // Εκτύπωση μηνύματος επιβεβαίωσης
            }
            while (choice != 1 && choice != 2);                                                              /* Η συνθήκη */
            for (dest = 1; dest < p; dest++)                                                             /* Βοηθητικ΄ός βρόχος για την αποστολή της επιλογής του χρήστη από το μενού και στις υπόλοιπες διεργασίες P1...P(p-1) */
                Check_MPI_Routines (MPI_Send (&choice, 1, MPI_INT, dest, tag_Choice, MPI_COMM_WORLD), "MPI_Send ()"); // Aποστολή της επιλογής του χρήστη από το μενού στις υπόλοιπες διεργασίες P1...P(p-1) και έλεγχος με την "Check_MPI_Routines ()" για τυχόν δυσλειτουργία
/*................................. Αναμονή μέχρι ο παραλήπτης (dest) καλέσει την αντίστοιχη MPI_Recv (γραμμή 179) με ετικέτα tag_Choice (παραλήπτες: P1,...,P(p-1)) ............................................*/            
            if (choice == 2)                                                                             /* Η επιλογή του χρήση ήταν η Έξοδος του προγράμματος */
                break;                                                                                   // Έξοδος της διεργασίας P0 από τον ατέρμονο βρόχο 
        }
/*-------------------------------------------------------------------------------------------------- P1,...,P(p-1) ---------------------------------------------------------------------------------------------*/    
        if (rank != 0)                                                                                   /* Κώδικας που θα εκτελέσουν μόνο οι διεργασίες P1...P(p-1) */
        {
            Check_MPI_Routines (MPI_Recv (&choice, 1, MPI_INT, 0, tag_Choice, MPI_COMM_WORLD, &status), "MPI_Recv ()"); // Παραλαβή της επιλογής του χρήστη από το μενού από την διεργασία P0 και έλεγχος με την "Check_MPI_Routines ()" για τυχόν δυσλειτουργία
/*................................. Αναμονή μέχρι ο πομπός καλέσει την αντίστοιχη MPI_Send (γραμμή 171) με ετικέτα tag_Choice (πομπός: P0) .......................................................................*/ 
            if (choice == 2)                                                                             /* Η επιλογή του χρήση ήταν η Έξοδος του προγράμματος */
                break;                                                                                   // Έξοδος των διεργασίων P1...P(p-1) από τον ατέρμονο βρόχο
        }
    }
 /******************************************************************************************************************************************************************************************************************/
    Check_MPI_Routines (MPI_Finalize (), "MPI_Finalize ()");                                             // Λήξη της χρήσης των MPI ρουτίνων και έλεγχος με την "Check_MPI_Routines ()" για τυχόν δυσλειτουργία 
        
    return 0;
}

/****************************************************************************************** Κώδικας Check_MPI_Routines ******************************************************************************************/ 
void Check_MPI_Routines (int return_value, char *mpi_routine)                                            /* Η συνάρτηση ελέγχου των τιμών επιστροφής των MPI ρουτίνων για τυχόν σφάλματα */
{
    if (return_value != MPI_SUCCESS)                                                                     /* Η τιμή επιστροφής της MPI ρουτίνας είναι σφάλματος */
    {
        printf ("Error in executing MPI routine \"%s\"\n", mpi_routine);                                 // Εκτύπωση μηνύματος σφάλματος κατά την εκτέλεση μίας MPI ρουτίνας
        MPI_Abort (MPI_COMM_WORLD, return_value);                                                        // Εγκατάλειψη της χρήσης των MPI ρουτίνων
    }
}
/****************************************************************************************** Κώδικας Check_Memory *************************************************************************************************/ 
void Check_Memory (int *seq)                                                                             /* Η συνάρτηση ελέγχου της δυναμικής δέσμευσης πινάκων για τυχόν σφάλματα */
{
    if (!seq)                                                                                            /* Αδυναμία δέσμευσης μνήμης */
    {
        printf ("Error in allocating heap memory\n");                                                    // Εκτύπωση μηνύματος σφάλματος κατά την δυναμική δέσμευση 
        exit (1);                                                                                        // Τερματισμός του προγράμματος με τιμή επιστροφής 1
    }
}
/****************************************************************************************** Κώδικας Check_Sort_Breaker ******************************************************************************************/ 
void Check_Sort_Breaker (int *seq, int n, int *ptr_sort_breaker, int *ptr_sort_breaker_exist)            /* Η συνάρτηση ελέγχου ταξινόμησης των στοιχείων της διεργασίας που την καλεί */
{
    int i;                                                                                               // Βοηθητική μεταβλητή για βρόχο

    for (i = 0; i < n; i++)                                                                              /* Βρόχος για την προσπέλαση των στοιχείων της διεργασίας που την καλεί */
    {
        if (i != n - 1)                                                                                  /* Η επανάληψη δεν έχει προσπελάσει το τελευταίο στοιχείο της διεργασίας  */
        {
            if (seq[i] > seq[i + 1])                                                                     /* Η ταξινόμηση χαλάει */
            {
                if (*ptr_sort_breaker_exist == 0)                                                        /* Ένδειξη ότι είναι το πρώτο στοιχείο της διεργασίας που χαλάει την ταξινόμηση */
                {
                    *ptr_sort_breaker = seq[i];                                                          // Το πρώτο στοιχείο της διεργασίας που χαλάει την ταξινόμηση
                    *ptr_sort_breaker_exist = 1;                                                         // Ένδειξη ότι βρέθηκε στοιχείο της διεργασίας που χαλάει την ταξινόμηση
                }
            }
        }
    }   
}